import pandas as pd

#        계좌   | 1월 | 2월 | 3월
#  0 | 신한은행 | 400 | 500 | 600
#  1 | 기업은행 | 100 | 200 | 300
#  2 | 우리은행 | 70  | 80  | 90


# Dictionary
sales1 = [
    {'계좌': '신한은행', '1월': '400', '2월': '500', '3월': '600'},
    {'계좌': '기업은행', '1월': '100', '2월': '200', '3월': '300'},
    {'계좌': '우리은행', '1월': '70', '2월': '80', '3월': '90'}
]
df1 = pd.DataFrame(sales1)
print('--------------------------------------------df1\n', df1)

# List
sales2 = [
    ('신한은행', 400, 500, 600),
    ('기업은행', 100, 200, 300),
    ('우리은행', 70, 80, 90),
]
labels = ['계좌', '1월', '2월', '3월']
df2 = pd.DataFrame.from_records(sales2, columns=labels)
print('--------------------------------------------df2\n', df2)

# Dictionary
sales3 = {
    '계좌': ['신한은행', '기업은행', '우리은행'],
    '1월': [400, 100, 70],
    '2월': [500, 200, 80],
    '3월': [600, 300, 90],
}
df3 = pd.DataFrame.from_dict(sales3)
print('--------------------------------------------df3\n', df3)

# List
sales4 = [
    ('계좌', ['기업은행', '기업은행', '우리은행']),
    ('1월', [400, 100, 70]),
    ('2월', [500, 200, 80]),
    ('3월', [600, 300, 90]),
]
# df4 = pd.DataFrame.from_items(sales4) - 사용 안됨

# 튜플 리스트를 사전으로 변환
data_dict = dict(sales4)
# 사전을 사용하여 DataFrame 생성
df4 = pd.DataFrame(data_dict)
print('--------------------------------------------df4\n', df4)