import pandas as pd

data = {
    '이름': ['채치수', '정대만', '송태섭', '서태웅', '강백호', '변덕규', '황태산', '윤대협'],
    '학교': ['북산고', '북산고', '북산고', '북산고', '북산고', '능남고', '능남고', '능남고'],
    '키': [197, 184, 168, 187, 188, 202, 188, 190],
    '국어': [90, 40, 80, 40, 15, 80, 55, 100],
    '영어': [85, 35, 75, 60, 20, 100, 65, 85],
    '수학': [100, 50, 70, 70, 10, 95, 45, 90],
    '과학': [95, 55, 80, 75, 35, 85, 40, 95],
    '사회': [85, 25, 75, 80, 10, 80, 35, 95],
    'SW특기': ['Python', 'Java', 'Javascript', '', '', 'C', 'PYTHON', 'C#']
}

df = pd.DataFrame(data, index=['1번', '2번', '3번', '4번', '5번', '6번', '7번', '8번'])
df.index.name = '지원번호'
print(df)

df['총합'] = df['국어'] + df['영어'] + df['수학'] + df['과학'] + df['사회']
df['결과'] = 'Fail'
df.loc[df['총합'] > 400, '결과'] = 'Pass'
# row 추가
df.loc['9번'] = ['박수민', '삼현고', 165, 90, 90, 90, 90, 90, 450, 'kotlin', 'Pass']
print(df)

# cell 수정
df.loc['4번', 'SW특기'] = 'python'
print(df)

df.loc['5번', ['학교', 'SW특기']] = ['삼현고', 'C']
print(df)

# column 순서 변경
cols = list(df.columns)
print(cols)  # ['이름', '학교', '키', '국어', '영어', '수학', '과학', '사회', 'SW특기', '총합', '결과']
print(df.columns)  # Index(['이름', '학교', '키', '국어', '영어', '수학', '과학', '사회', 'SW특기', '총합', '결과'], dtype='object')

# 맨 뒤에 있는 결과 column을 맨 앞으로 가져오고, 뒤에 나머지 columns 붙임
df = df[[cols[-1]] + cols[0:-1]]
print(df)
# df의 값을 가져올때 : df[]
# 하나의 값이기 때문에 리스트로 감싸줘야 함 그래서 밖에 [] 한 것: [cols[-1]]
# 리스트형태로 슬라이싱 된 것: cols[0:-1]

df = df[['결과', '이름', '학교']]
print(df)

# column 이름 변경
print(df.columns)  # Index(['결과', '이름', '학교'], dtype='object')
df.columns = ['Result', 'Name', 'School']
print(df)
